{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "auto_map": {
    "AutoConfig": "configuration_llama.LlamaConfig",
    "AutoModelForCausalLM": "modeling_llama.LlamaForCausalLM"
  },
  "d": 0,
  "cqil_layers": [
    [
      12,
      13
    ],
    [
      14,
      15
    ],
    [
      16,
      17
    ],
    [
      18,
      19
    ],
    [
      20,
      21
    ],
    [
      22,
      23
    ],
    [
      24,
      25
    ],
    [
      26,
      27
    ],
    [
      28,
      29
    ]
  ],
  "cqil_layers_p4": [
    [
      14,
      15,
      16,
      17
    ],
    [
      18,
      19,
      20,
      21
    ],
    [
      22,
      23,
      24,
      25
    ],
    [
      26,
      27,
      28,
      29
    ]
  ],
  "output_hidden_states": false,
  "output_attentions": false,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.28.0.dev0",
  "use_cache": true,
  "vocab_size": 32000
}
