{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_qwen2.Qwen2Config",
    "AutoModelForCausalLM": "modeling_qwen2.Qwen2ForCausalLM"
  },
  "d": 0,
  "cqil_layers": [
    [
      17,
      18
    ],
    [
      19,
      20
    ],
    [
      21,
      22
    ],
    [
      23,
      24
    ],
    [
      25,
      26
    ],
    [
      27,
      28
    ],
    [
      29,
      30
    ],
    [
      31,
      32
    ],
    [
      33,
      34
    ],
    [
      35,
      36
    ]
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 13696,
  "max_position_embeddings": 32768,
  "max_window_layers": 35,
  "model_type": "qwen2",
  "num_attention_heads": 40,
  "num_hidden_layers": 40,
  "num_key_value_heads": 40,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.37.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 152064
}
