{
  "alpha_pattern": {},
  "auto_mapping": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.9.self_attn.q_proj",
    "model.layers.0.self_attn.o_proj",
    "model.layers.12.self_attn.k_proj",
    "model.layers.8.mlp.down_proj",
    "model.layers.24.self_attn.o_proj",
    "model.layers.0.self_attn.q_proj",
    "model.layers.25.self_attn.q_proj",
    "model.layers.31.self_attn.k_proj",
    "model.layers.1.self_attn.v_proj",
    "model.layers.14.self_attn.k_proj",
    "model.layers.19.mlp.up_proj",
    "model.layers.18.mlp.gate_proj",
    "model.layers.19.self_attn.o_proj",
    "model.layers.14.mlp.gate_proj",
    "model.layers.26.mlp.down_proj",
    "model.layers.20.mlp.down_proj",
    "model.layers.30.mlp.gate_proj",
    "model.layers.10.mlp.down_proj",
    "model.layers.9.self_attn.k_proj",
    "model.layers.30.mlp.down_proj",
    "model.layers.25.self_attn.v_proj",
    "model.layers.3.mlp.gate_proj",
    "model.layers.16.self_attn.v_proj",
    "model.layers.2.mlp.down_proj",
    "model.layers.13.mlp.gate_proj",
    "model.layers.7.mlp.gate_proj",
    "model.layers.14.self_attn.q_proj",
    "model.layers.0.mlp.gate_proj",
    "model.layers.17.self_attn.k_proj",
    "model.layers.31.mlp.down_proj",
    "model.layers.20.self_attn.o_proj",
    "model.layers.1.mlp.up_proj",
    "model.layers.4.mlp.gate_proj",
    "model.layers.24.self_attn.v_proj",
    "model.layers.13.self_attn.v_proj",
    "model.layers.25.mlp.up_proj",
    "model.layers.28.self_attn.v_proj",
    "model.layers.15.self_attn.k_proj",
    "model.layers.2.self_attn.q_proj",
    "model.layers.20.self_attn.v_proj",
    "model.layers.17.self_attn.v_proj",
    "model.layers.21.mlp.up_proj",
    "model.layers.13.self_attn.o_proj",
    "model.layers.28.mlp.down_proj",
    "model.layers.31.self_attn.o_proj",
    "model.layers.26.self_attn.q_proj",
    "model.layers.30.self_attn.k_proj",
    "model.layers.25.mlp.gate_proj",
    "model.layers.24.mlp.down_proj",
    "model.layers.4.mlp.down_proj",
    "model.layers.10.mlp.gate_proj",
    "model.layers.14.self_attn.o_proj",
    "model.layers.8.mlp.up_proj",
    "model.layers.27.mlp.up_proj",
    "model.layers.17.self_attn.q_proj",
    "model.layers.2.mlp.gate_proj",
    "model.layers.19.self_attn.q_proj",
    "model.layers.3.self_attn.v_proj",
    "model.layers.24.self_attn.q_proj",
    "model.layers.1.mlp.down_proj",
    "model.layers.29.self_attn.o_proj",
    "model.layers.29.self_attn.k_proj",
    "model.layers.13.mlp.down_proj",
    "model.layers.0.mlp.down_proj",
    "model.layers.24.mlp.gate_proj",
    "model.layers.23.self_attn.k_proj",
    "model.layers.1.self_attn.k_proj",
    "model.layers.3.mlp.down_proj",
    "model.layers.12.mlp.down_proj",
    "model.layers.26.self_attn.o_proj",
    "model.layers.11.self_attn.o_proj",
    "model.layers.26.mlp.up_proj",
    "model.layers.7.self_attn.v_proj",
    "model.layers.6.mlp.up_proj",
    "model.layers.17.mlp.up_proj",
    "model.layers.16.mlp.down_proj",
    "model.layers.22.self_attn.v_proj",
    "model.layers.3.self_attn.o_proj",
    "model.layers.22.mlp.gate_proj",
    "model.layers.31.self_attn.v_proj",
    "model.layers.23.mlp.gate_proj",
    "model.layers.6.mlp.down_proj",
    "model.layers.29.mlp.gate_proj",
    "model.layers.2.self_attn.v_proj",
    "model.layers.22.self_attn.k_proj",
    "model.layers.2.self_attn.o_proj",
    "model.layers.23.mlp.up_proj",
    "model.layers.24.mlp.up_proj",
    "model.layers.20.mlp.up_proj",
    "model.layers.21.self_attn.q_proj",
    "model.layers.15.self_attn.q_proj",
    "model.layers.6.self_attn.o_proj",
    "model.layers.10.mlp.up_proj",
    "model.layers.29.self_attn.v_proj",
    "model.layers.11.self_attn.q_proj",
    "model.layers.27.self_attn.v_proj",
    "model.layers.5.mlp.gate_proj",
    "model.layers.12.mlp.gate_proj",
    "model.layers.13.mlp.up_proj",
    "model.layers.12.self_attn.q_proj",
    "model.layers.11.self_attn.k_proj",
    "model.layers.7.mlp.down_proj",
    "model.layers.16.self_attn.k_proj",
    "model.layers.30.self_attn.o_proj",
    "model.layers.9.self_attn.o_proj",
    "model.layers.4.self_attn.o_proj",
    "model.layers.22.self_attn.o_proj",
    "model.layers.28.mlp.up_proj",
    "model.layers.21.mlp.gate_proj",
    "model.layers.15.self_attn.o_proj",
    "model.layers.6.mlp.gate_proj",
    "model.layers.11.mlp.up_proj",
    "model.layers.5.self_attn.k_proj",
    "model.layers.15.self_attn.v_proj",
    "model.layers.19.self_attn.v_proj",
    "model.layers.20.self_attn.q_proj",
    "model.layers.29.mlp.up_proj",
    "model.layers.15.mlp.down_proj",
    "model.layers.18.self_attn.k_proj",
    "model.layers.2.self_attn.k_proj",
    "model.layers.23.self_attn.o_proj",
    "model.layers.14.self_attn.v_proj",
    "model.layers.4.self_attn.v_proj",
    "model.layers.31.mlp.gate_proj",
    "model.layers.17.mlp.gate_proj",
    "model.layers.3.self_attn.k_proj",
    "model.layers.7.self_attn.q_proj",
    "model.layers.27.self_attn.o_proj",
    "model.layers.26.mlp.gate_proj",
    "model.layers.31.self_attn.q_proj",
    "model.layers.4.self_attn.k_proj",
    "model.layers.17.self_attn.o_proj",
    "model.layers.4.mlp.up_proj",
    "model.layers.22.mlp.up_proj",
    "model.layers.0.mlp.up_proj",
    "model.layers.21.self_attn.o_proj",
    "model.layers.0.self_attn.v_proj",
    "model.layers.11.self_attn.v_proj",
    "model.layers.11.mlp.down_proj",
    "model.layers.7.self_attn.k_proj",
    "model.layers.27.mlp.down_proj",
    "model.layers.29.self_attn.q_proj",
    "model.layers.2.mlp.up_proj",
    "model.layers.3.mlp.up_proj",
    "model.layers.12.mlp.up_proj",
    "model.layers.30.self_attn.v_proj",
    "model.layers.25.self_attn.k_proj",
    "model.layers.5.mlp.up_proj",
    "model.layers.25.self_attn.o_proj",
    "model.layers.18.mlp.down_proj",
    "model.layers.0.self_attn.k_proj",
    "model.layers.23.self_attn.q_proj",
    "model.layers.13.self_attn.q_proj",
    "model.layers.19.self_attn.k_proj",
    "model.layers.23.mlp.down_proj",
    "model.layers.16.self_attn.o_proj",
    "model.layers.5.self_attn.v_proj",
    "model.layers.18.self_attn.o_proj",
    "model.layers.3.self_attn.q_proj",
    "model.layers.6.self_attn.v_proj",
    "model.layers.8.self_attn.k_proj",
    "model.layers.29.mlp.down_proj",
    "model.layers.12.self_attn.v_proj",
    "model.layers.22.self_attn.q_proj",
    "model.layers.13.self_attn.k_proj",
    "model.layers.9.mlp.gate_proj",
    "model.layers.5.self_attn.o_proj",
    "model.layers.1.mlp.gate_proj",
    "model.layers.9.mlp.up_proj",
    "model.layers.1.self_attn.q_proj",
    "model.layers.20.self_attn.k_proj",
    "model.layers.5.self_attn.q_proj",
    "model.layers.16.self_attn.q_proj",
    "model.layers.9.self_attn.v_proj",
    "model.layers.28.mlp.gate_proj",
    "model.layers.27.self_attn.k_proj",
    "model.layers.8.self_attn.q_proj",
    "model.layers.12.self_attn.o_proj",
    "model.layers.18.self_attn.v_proj",
    "model.layers.10.self_attn.o_proj",
    "model.layers.28.self_attn.o_proj",
    "model.layers.8.self_attn.o_proj",
    "model.layers.21.self_attn.v_proj",
    "model.layers.6.self_attn.q_proj",
    "model.layers.25.mlp.down_proj",
    "model.layers.26.self_attn.k_proj",
    "model.layers.15.mlp.up_proj",
    "model.layers.17.mlp.down_proj",
    "model.layers.11.mlp.gate_proj",
    "model.layers.15.mlp.gate_proj",
    "model.layers.8.self_attn.v_proj",
    "model.layers.1.self_attn.o_proj",
    "model.layers.23.self_attn.v_proj",
    "model.layers.7.self_attn.o_proj",
    "model.layers.19.mlp.gate_proj",
    "model.layers.21.mlp.down_proj",
    "model.layers.21.self_attn.k_proj",
    "model.layers.26.self_attn.v_proj",
    "model.layers.9.mlp.down_proj",
    "model.layers.10.self_attn.k_proj",
    "model.layers.28.self_attn.k_proj",
    "model.layers.27.mlp.gate_proj",
    "model.layers.4.self_attn.q_proj",
    "model.layers.7.mlp.up_proj",
    "model.layers.14.mlp.up_proj",
    "model.layers.30.mlp.up_proj",
    "model.layers.18.self_attn.q_proj",
    "model.layers.10.self_attn.q_proj",
    "model.layers.18.mlp.up_proj",
    "model.layers.14.mlp.down_proj",
    "model.layers.8.mlp.gate_proj",
    "model.layers.20.mlp.gate_proj",
    "model.layers.24.self_attn.k_proj",
    "model.layers.5.mlp.down_proj",
    "model.layers.30.self_attn.q_proj",
    "model.layers.6.self_attn.k_proj",
    "model.layers.16.mlp.up_proj",
    "model.layers.19.mlp.down_proj",
    "model.layers.10.self_attn.v_proj",
    "model.layers.27.self_attn.q_proj",
    "model.layers.31.mlp.up_proj",
    "model.layers.16.mlp.gate_proj",
    "model.layers.22.mlp.down_proj",
    "model.layers.28.self_attn.q_proj"
  ],
  "task_type": "CAUSAL_LM"
}